sensorOpt/con/8.0_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       225007;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       225407;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       225607;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       226007;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          112601;
        startFace       226207;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          112601;
        startFace       338808;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          334;
        startFace       451409;
    }
)

// ************************************************************************* //
